---
title: TableCellStyle
classe: Autodesk.Revit.DB.TableCellStyle
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 24
---

# TableCellStyle

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Color BackgroundColor { get; set; }` | `tableCellStyle.BackgroundColor` | Color |
| `ElementId BorderBottomLineStyle { get; set; }` | `tableCellStyle.BorderBottomLineStyle` | ElementId |
| `ElementId BorderLeftLineStyle { get; set; }` | `tableCellStyle.BorderLeftLineStyle` | ElementId |
| `ElementId BorderRightLineStyle { get; set; }` | `tableCellStyle.BorderRightLineStyle` | ElementId |
| `ElementId BorderTopLineStyle { get; set; }` | `tableCellStyle.BorderTopLineStyle` | ElementId |
| `HorizontalAlignmentStyle FontHorizontalAlignment { get; set; }` | `tableCellStyle.FontHorizontalAlignment` | HorizontalAlignmentStyle |
| `String FontName { get; set; }` | `tableCellStyle.FontName` | String |
| `VerticalAlignmentStyle FontVerticalAlignment { get; set; }` | `tableCellStyle.FontVerticalAlignment` | VerticalAlignmentStyle |
| `Boolean IsEnabled { get; set; }` | `tableCellStyle.IsEnabled` | Boolean |
| `Boolean IsFontBold { get; set; }` | `tableCellStyle.IsFontBold` | Boolean |
| `Boolean IsFontItalic { get; set; }` | `tableCellStyle.IsFontItalic` | Boolean |
| `Boolean IsFontUnderline { get; set; }` | `tableCellStyle.IsFontUnderline` | Boolean |
| `Boolean IsInactivePhaseload { get; set; }` | `tableCellStyle.IsInactivePhaseload` | Boolean |
| `Boolean IsOverridden { get; }` | `tableCellStyle.IsOverridden` | Boolean |
| `Boolean IsReadOnly { get; set; }` | `tableCellStyle.IsReadOnly` | Boolean |
| `Boolean IsValidObject { get; }` | `tableCellStyle.IsValidObject` | Boolean |
| `Color SheetBackgroundColor { get; }` | `tableCellStyle.SheetBackgroundColor` | Color |
| `Color TextColor { get; set; }` | `tableCellStyle.TextColor` | Color |
| `Int32 TextOrientation { get; set; }` | `tableCellStyle.TextOrientation` | Int32 |
| `Double TextSize { get; set; }` | `tableCellStyle.TextSize` | Double |
| `Void Dispose()` | `tableCellStyle.Dispose()` | Void |
| `TableCellStyleOverrideOptions GetCellStyleOverrideOptions()` | `tableCellStyle.GetCellStyleOverrideOptions()` | TableCellStyleOverrideOptions |
| `Void ResetOverride()` | `tableCellStyle.ResetOverride()` | Void |
| `Void SetCellStyleOverrideOptions(TableCellStyleOverrideOptions)` | `tableCellStyle.SetCellStyleOverrideOptions(helper)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```